# Centroid

## Description
Returns the centroid of the object. Returns false if an unsupported object type is supplied.

```pascal
FUNCTION Centroid(
				h     : HANDLE;
				VAR x : REAL;
				VAR y : REAL) : BOOLEAN;
```

```python

def vs.Centroid(h):
    return (BOOLEAN, x, y)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||
|x|REAL||
|y|REAL||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation